/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Valor inválido.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "O valor “%@” é inválido.";

/* NSFormattingError */
"Err2048-C" = "Erro de formatação.";

/* NSFileLockingError */
"Err255-C" = "Não foi possível proteger o ficheiro.";

/* NSFileLockingError */
"Err255-R" = "O ficheiro poderá estar já protegido ou poderá não dispor de privilégios de acesso suficientes para o proteger.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Não foi possível proteger o ficheiro “%@”.";

/* NSFileReadUnknownError */
"Err256" = "Não foi possível abrir o ficheiro.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Não foi possível abrir o ficheiro “%@”.";

/* NSFileReadNoPermissionError */
"Err257" = "Não foi possível abrir o ficheiro porque não dispõe dos privilégios de acesso necessários.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Não dispõe dos privilégios de acesso necessários.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Para ver ou alterar privilégios de acesso, seleccione o item no Finder e seleccione Ficheiro > Informações.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Não foi possível abrir o ficheiro “%@” porque não dispõe dos privilégios de acesso necessários.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "O nome do ficheiro é inválido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Não foi possível abrir o item porque o nome “%@” é inválido.";

/* NSFileReadCorruptFileError */
"Err259" = "Não foi possível abrir o ficheiro porque não apresenta o formato correcto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "O ficheiro não apresenta o formato correcto.";

/* NSFileReadCorruptFileError */
"Err259-R" = "O ficheiro poderá estar danificado, truncado ou num formato diferente do esperado.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Não foi possível abrir o ficheiro “%@” porque não apresenta o formato correcto.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "O ficheiro não existe.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "O ficheiro “%@” não existe.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Não foi possível abrir o ficheiro com a codificação de texto especificada.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "O ficheiro poderá ter sido guardado utilizando uma codificação de texto diferente ou poderá não ser um ficheiro de texto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Não foi possível abrir o ficheiro com a codificação de texto %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Não foi possível abrir o ficheiro “%2$@” com a codificação de texto %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Não foi possível abrir o ficheiro porque o tipo especificado de URL não é suportado.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "O tipo especificado de URL não é suportado.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Não foi possível abrir o ficheiro “%1$@” porque o tipo de URL %2$@ não é suportado.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Não foi possível abrir o ficheiro porque o URL %@ não é suportado.";

/* NSFileReadTooLargeError */
"Err263" = "Não foi possível abrir o ficheiro, porque é demasiado grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "O ficheiro é demasiado grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Não foi possível abrir o ficheiro “%@” por ser demasiado grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Não foi possível abrir o ficheiro, porque não foi possível determinar a codificação do texto do conteúdo.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Não foi possível determinar a codificação do texto do conteúdo.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Não foi possível abrir o ficheiro especificando uma codificação de texto explicitamente.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Não foi possível abrir o ficheiro “%@”, por não ter sido possível determinar a codificação de texto do conteúdo.";

/* NSUserCancelledError */
"Err3072-C" = "A operação foi cancelada.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Não foi possível remover “%@”.";

/* NSFileNoSuchFileError */
"Err4-C" = "O ficheiro não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "O ficheiro “%@” não existe.";

/* NSFileWriteUnknownError */
"Err512" = "Não foi possível guardar o ficheiro.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Não foi possível copiar “%1$@” para “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Não foi possível ligar “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Não foi possível mover “%1$@” para “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Não foi possível remover “%@”.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Não foi possível guardar o ficheiro “%2$@” na pasta “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Não foi possível guardar o ficheiro “%@”.";

/* NSFileWriteNoPermissionError */
"Err513" = "Não foi possível guardar o ficheiro porque não dispõe dos privilégios de acesso necessários.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Não foi possível copiar “%1$@” porque não dispõe dos privilégios de acesso necessários a “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Não foi possível ligar “%1$@” porque não dispõe dos privilégios de acesso necessários a “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Não foi possível mover “%1$@” porque não dispõe dos privilégios de acesso necessários a “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Não foi possível remover “%@” porque não dispõe dos privilégios de acesso necessários.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Não dispõe dos privilégios de acesso necessários.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Para ver ou alterar privilégios de acesso, seleccione o item no Finder e seleccione Ficheiro > Informações.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Não dispõe dos privilégios de acesso necessários para guardar o ficheiro “%2$@” na pasta “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Não dispõe dos privilégios de acesso necessários para guardar o ficheiro “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Não foi possível guardar o item porque o nome é inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Não foi possível remover o item porque o nome “%@” é inválido.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "O nome do ficheiro é inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Não foi possível guardar o item porque o nome “%@” é inválido.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Não foi possível guardar o ficheiro com a codificação de texto especificada.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Seleccione, se possível, outra codificação de texto.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Não foi possível guardar o ficheiro com a codificação de texto %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Não foi possível guardar o ficheiro “%2$@” com a codificação de texto %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Não foi possível guardar o ficheiro porque o tipo especificado de URL não é suportado.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "O tipo especificado de URL não é suportado.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Não foi possível guardar o ficheiro “%1$@” porque o tipo de URL %2$@ não é suportado.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Não foi possível guardar o ficheiro porque o URL %@ não é suportado.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Não foi possível guardar o ficheiro, porque não existe espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Não foi possível copiar “%1$@” para “%2$@”, por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Não foi possível ligar “%1$@” a “%2$@”, por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Não foi possível mover “%1$@” para “%2$@”, por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Não existe espaço suficiente.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "O volume “%@” está cheio.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Elimine alguns ficheiros do volume e tente de novo.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Não é possível guardar o ficheiro “%@”, porque não existe espaço suficiente.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Não é possível guardar o ficheiro “%1$@” porque o volume “%2$@” está cheio.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Não foi possível concluir a operação. (Erro de %1$@ %2$ld.)";

